# Используем официальный образ Python в качестве базового
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы проекта в контейнер
COPY . /app

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Устанавливаем переменные среды (при необходимости)
# ENV VARIABLE_NAME=value

# Открываем порт для приложения (если необходимо)
# EXPOSE 8000

# Устанавливаем команду для запуска приложения
CMD ["python", "__main__.py"]
